import datetime

################################################################
def printTimeStamp(name):									  ##
 print('Автор програми: ' + name)							  ##
 print('Час компіляції: ' + str(datetime.datetime.now()))	  ##
print(printTimeStamp('Beliaev and Pereviznyk'))				  ##
################################################################
x = True               
ls =[]                  # Створив список
print('Якщо потрібно зупинити программу, введіть 0')
print('Вводіть числа: ') 
while x:                # Доки x Істине, буде працювати цикл
	path = int(input()) # Перемінна для чисел
	ls.append(path)     # Добавляє число до списку
	if path == 0 :      # Якщо в перемінну path вписати '0', цикл закінчить свою роботу 
	   x = False        # Переключає x на Хибне 

ls.pop()   # Видаляє останній елемент в списку ('0')
ls.sort()  # Сортує спискок від найменшого до найбільшого 
print(ls)  # Результат 

