import datetime

################################################################
def printTimeStamp(name):									  ##
 print('Автор програми: ' + name)							  ##
 print('Час компіляції: ' + str(datetime.datetime.now()))	  ##
print(printTimeStamp('Beliaev and Pereviznyk'))				  ##
################################################################
print("Місце проживання (Гуртожиток, Квартира, Будинок)")
home = input('Введіть місце проживання: ')

time = int(input('Введіть скільки годин ви приблизно знаходитесь дома: '))
print('                                           ')

if home =='Гуртожиток':
	#Мурашник 
	if time < 6:
	  print('Тобі підійде: Мурашник')
	#Мурашник або Рибки
    elif time == 6 :
      print('Тобі підійде: Мурашник або рибки')
    #Рибки 
    elif time > 6:
	  print('Тобі підійдуть: Рибки')

elif  home =='Квартира':
	#Хом'як
	if time <10 :
      print("Тобі підійде: Хом'як")



#Хом'як або Кішка
elif home =='Квартира' and time == 10 :
	print("Тобі підійде: Хом'як або Кішка")

#Кішка
elif home =='Квартира' and time > 10:
	print('Тобі підійде: Кішка')

#Змія
elif home =='Будинок' and time <=10 :
	print("Тобі підійде: Змія")	

#Собака
elif home =='Будинок' and time >10 and time <17:
	print("Тобі підійде: Собака")

#В’єтнамське порося
elif home =='Будинок' and time > 18:
	print('Тобі підійде: В’єтнамське порося')
