# відкриття початкового файлу
f = open('text.txt', 'r')
# створення списку з інформацію(строк) пачаткового файлу та закриття файлу
l = [line.strip() for line in f]
f.close()
# створення вихідного списку(пустого) для запису у вихідний файл
l_new = []
# обчислення кількості елементів(строк) у списку
len_l = len(l)
# основна операційна змінна
lm = 0
# основний цикл для змінення елементів та запис їх у новий список
while lm < len_l:
    x_new = l[lm] + "бум-бум-кабум!"
    l_new.append(x_new)
    lm += 1
# відкриття вихідного файлу,запис інформації та закриття файлу
h = open('text_2.txt', 'w')
h.write("\n".join(l_new))
h.close()
print("запис проведено")